return {
  {
    "folke/snacks.nvim",
    opts = function(_, opts)
      opts.picker = opts.picker or {}
      opts.picker.hidden = true -- for hidden files
      opts.picker.ignored = true -- for .gitignore files

      opts.dashboard = opts.dashboard or {}
      opts.dashboard.preset = opts.dashboard.preset or {}
      opts.dashboard.preset.header = [[
██╗  ██╗ ███████╗ ███╗   ██╗ ██████╗  ██╗   ██╗ ██╗   ██╗ ██╗ ███╗   ███╗
██║  ██║ ██╔════╝ ████╗  ██║ ██╔══██╗ ╚██╗ ██╔╝ ██║   ██║ ██║ ████╗ ████║
███████║ █████╗   ██╔██╗ ██║ ██████╔╝  ╚████╔╝  ██║   ██║ ██║ ██╔████╔██║
██╔══██║ ██╔══╝   ██║╚██╗██║ ██╔══██╗   ╚██╔╝   ╚██╗ ██╔╝ ██║ ██║╚██╔╝██║
██║  ██║ ███████╗ ██║ ╚████║ ██║  ██║    ██║     ╚████╔╝  ██║ ██║ ╚═╝ ██║
╚═╝  ╚═╝ ╚══════╝ ╚═╝  ╚═══╝ ╚═╝  ╚═╝    ╚═╝      ╚═══╝   ╚═╝ ╚═╝     ╚═╝
]]
    end,
  },
}
